БылковДА70180166/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>УченоеЗвание</name>
    <type>
      <types>EnumRef.УченоеЗвание</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДополнительнаяИнформация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
</mdclass:Catalog>

БылковДА70180166/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЕстьДопополнительнаяИнформацияПриИзменении(Элемент)
	Если Объект.ЕстьДополнительнаяИнформация = Истина Тогда
		Элементы.ДополнительнаяИнформация.Видимость = Истина;
		
	Иначе
		Элементы.ДополнительнаяИнформация.Видимость = Ложь;    
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.IDСотрудника) Тогда
        Сообщить("Необходимо заполнить личный индекс студента.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    ПроверитьУникальностьИндекса(Отказ, Объект.IDСотрудника, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИндекса(Отказ, ЛичныйИндекс, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
         | Сотрудники.Ссылка
    |ИЗ
         | Справочник.Сотрудники КАК Сотрудники
    |ГДЕ
         | Сотрудники.IDСотрудника = &IDСотрудника
         | И Сотрудники.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("IDСотрудника", ЛичныйИндекс);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой личный индекс уже существует!");
        Отказ = Истина;
    КонецЕсли;

КонецПроцедуры
